docs/evidence/phase-02/products/pool10-post-index/k6-summary.txt
 Container postgres Running 
 Container postgres_exporter Running 
 Container prometheus Running 
 Container postgres Waiting 
 Container postgres Healthy 
 Container db-project-k6-run-ec495516302a Creating 
 Container db-project-k6-run-ec495516302a Created 
time="2026-06-17T07:11:13Z" level=warning msg="open() was used and is currently relative to 'file:///scripts/', but in the future it will be aligned with how `require` and imports work and will be relative to 'file:///scripts/lib/config.js'. This means that in the future open will open relative path relative to the module/file it is written in. You can future proof this by using `import.meta.resolve()` to get relative paths to the file it is written in the current k6 version."

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/products-test.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 300 max VUs, 5m30s max duration (incl. graceful stop):
              * steady: 50.00 iterations/s for 5m0s (maxVUs: 100-300, gracefulStop: 30s)


running (0m00.9s), 001/100 VUs, 43 complete and 0 interrupted iterations
steady   [   0% ] 001/100 VUs  0m00.9s/5m0s  50.00 iters/s

running (0m01.9s), 005/100 VUs, 89 complete and 0 interrupted iterations
steady   [   1% ] 005/100 VUs  0m01.9s/5m0s  50.00 iters/s


running (4m59.9s), 001/100 VUs, 14993 complete and 0 interrupted iterations
steady   [ 100% ] 001/100 VUs  4m59.9s/5m0s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=18.49ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 30002   100.00087/s
    checks_succeeded...: 100.00% 30002 out of 30002
    checks_failed......: 0.00%   0 out of 30002


    HTTP
    http_req_blocked...............: avg=0.04ms  min=0.00ms med=0.00ms  max=89.67ms   p(90)=0.01ms  p(95)=0.01ms  p(99)=0.47ms 
    http_req_connecting............: avg=0.02ms  min=0.00ms med=0.00ms  max=89.56ms   p(90)=0.00ms  p(95)=0.00ms  p(99)=0.41ms 
    http_req_duration..............: avg=17.29ms min=7.78ms med=11.91ms max=1408.91ms p(90)=16.98ms p(95)=18.49ms p(99)=81.38ms
      { expected_response:true }...: avg=17.29ms min=7.78ms med=11.91ms max=1408.91ms p(90)=16.98ms p(95)=18.49ms p(99)=81.38ms
    http_req_failed................: 0.00%  0 out of 15001
    http_req_receiving.............: avg=0.31ms  min=0.01ms med=0.12ms  max=141.40ms  p(90)=0.62ms  p(95)=0.71ms  p(99)=1.07ms 
    http_req_sending...............: avg=0.02ms  min=0.00ms med=0.01ms  max=35.23ms   p(90)=0.02ms  p(95)=0.03ms  p(99)=0.08ms 
    http_req_tls_handshaking.......: avg=0.00ms  min=0.00ms med=0.00ms  max=0.00ms    p(90)=0.00ms  p(95)=0.00ms  p(99)=0.00ms 
    http_req_waiting...............: avg=16.96ms min=7.74ms med=11.77ms max=1408.50ms p(90)=16.38ms p(95)=17.86ms p(99)=81.09ms
    http_reqs......................: 15001  50.000435/s

    EXECUTION
    iteration_duration.............: avg=17.55ms min=7.89ms med=12.08ms max=1409.36ms p(90)=17.17ms p(95)=18.77ms p(99)=84.77ms
    iterations.....................: 15001  50.000435/s
    vus............................: 1      min=1          max=36 
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 268 MB 893 kB/s
    data_sent......................: 2.1 MB 7.1 kB/s


  █ SCENARIO: products 

    checks_total.......: 30002   100.00087/s
    checks_succeeded...: 100.00% 30002 out of 30002
    checks_failed......: 0.00%   0 out of 30002


    HTTP
    http_req_blocked...........: avg=0.04ms  min=0.00ms med=0.00ms  max=89.67ms   p(90)=0.01ms  p(95)=0.01ms  p(99)=0.47ms 
    http_req_connecting........: avg=0.02ms  min=0.00ms med=0.00ms  max=89.56ms   p(90)=0.00ms  p(95)=0.00ms  p(99)=0.41ms 
    http_req_duration..........: avg=17.29ms min=7.78ms med=11.91ms max=1408.91ms p(90)=16.98ms p(95)=18.49ms p(99)=81.38ms
    http_req_failed............: 0.00%  0 out of 15001
    http_req_receiving.........: avg=0.31ms  min=0.01ms med=0.12ms  max=141.40ms  p(90)=0.62ms  p(95)=0.71ms  p(99)=1.07ms 
    http_req_sending...........: avg=0.02ms  min=0.00ms med=0.01ms  max=35.23ms   p(90)=0.02ms  p(95)=0.03ms  p(99)=0.08ms 
    http_req_tls_handshaking...: avg=0.00ms  min=0.00ms med=0.00ms  max=0.00ms    p(90)=0.00ms  p(95)=0.00ms  p(99)=0.00ms 
    http_req_waiting...........: avg=16.96ms min=7.74ms med=11.77ms max=1408.50ms p(90)=16.38ms p(95)=17.86ms p(99)=81.09ms
    http_reqs..................: 15001  50.000435/s

    EXECUTION
    iteration_duration.........: avg=17.55ms min=7.89ms med=12.08ms max=1409.36ms p(90)=17.17ms p(95)=18.77ms p(99)=84.77ms
    iterations.................: 15001  50.000435/s
    vus........................: 1      min=1          max=36 
    vus_max....................: 100    min=100        max=100

    NETWORK
    data_received..............: 268 MB 893 kB/s
    data_sent..................: 2.1 MB 7.1 kB/s



running (5m00.0s), 000/100 VUs, 15001 complete and 0 interrupted iterations
steady ✓ [ 100% ] 000/100 VUs  5m0s  50.00 iters/s